---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WindowTypeName
source: html/619ba382-8c98-bb3e-76ce-00b1e2a7902d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WindowTypeName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId WindowTypeName { get; }
```